---
kind: type
id: T:Autodesk.Revit.DB.BackgroundImageFit
source: html/7948e97e-d74a-3b6a-e2fd-eb82bfdac7f0.htm
---
# Autodesk.Revit.DB.BackgroundImageFit

Indicates the background image fit type in rendering settings.

## Syntax (C#)
```csharp
public enum BackgroundImageFit
```